Catalogs/DMS_СтатусыОтчетовПоРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_СтатусыОтчетовПоРекламнойКампании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВОтчете</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтТекста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_СтатусыОтчетовПоРекламнойКампании/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	мЦвет = мОбъект.ЦветФона.Получить();
	
	Если мЦвет <> Неопределено Тогда
		ЦветФона = мЦвет;
	Иначе 
		ЦветФона = ЦветаСтиля.ЦветРамки;
	КонецЕсли; 
	
	мЦветТекста = мОбъект.ЦветТекста.Получить();
	
	Если мЦветТекста <> Неопределено Тогда
		ЦветТекста = мЦветТекста;
	Иначе 
		ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли; 
	
	мШрифт = мОбъект.ШрифтТекста.Получить();
	
	Если мШрифт <> Неопределено Тогда
		Шрифт = мШрифт;
	Иначе 
		Шрифт = ШрифтыСтиля.ОбычныйШрифтТекста;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона    = Новый ХранилищеЗначения(ЦветФона,Новый СжатиеДанных(9));
	ТекущийОбъект.ЦветТекста  = Новый ХранилищеЗначения(ЦветТекста,Новый СжатиеДанных(9));
	ТекущийОбъект.ШрифтТекста = Новый ХранилищеЗначения(Шрифт,Новый СжатиеДанных(9));
	
КонецПроцедуры
